spp901780/ElecPartsM_Embedded/.pack/Keil/STM32F0xx_DFP.2.1.0/CMSIS/Driver/SPI_STM32F0xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2017 ARM Ltd.
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        10. November 2017
 * $Revision:    V1.0
 *
 * Driver:       Driver_SPI1, Driver_SPI2
 *
 * Configured:   via STM32CubeMx configuration tool
 * Project:      SPI Driver for STMicroelectronics STM32F0xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                 Value   SPI Interface
 *   ---------------------                 -----   -------------
 *   Connect to hardware via Driver_SPI# = 1       use SPI1
 *   Connect to hardware via Driver_SPI# = 2       use SPI2
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.0
 *    Initial release
 */

/*! \page stm32f0_spi CMSIS-Driver SPI Setup 

The CMSIS-Driver SPI requires:
  - Setup of SPIx input clock
  - Setup of SPIx in Full-Duplex Master/Slave mode with optional DMA for Rx and Tx transfers

Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource | STM32091C-EVAL            | STM32072B-EVAL            |
:-------------------|:--------------------------|---------------------------|
SPI Peripheral      | SPI1                      | SPI1                      |
SPI Mode            | <b>Full-Duplex Master</b> | <b>Full-Duplex Master</b> |
MOSI Pin            | PE15                      | PE15                      |
MISO Pin            | PE14                      | PE14                      |
SCK Pin             | PE13                      | PB3                       |

For different boards, refer to the hardware schematics to reflect correct setup values.

The STM32CubeMX configuration for STMicroelectronics STM32091C-EVAL Board with steps for Pinout, Clock, and System Configuration are 
listed below. Enter the values that are marked \b bold.

Pinout tab
----------
  1. Configure peripheral
     - Peripherals \b SPI1: Mode=<b>Full-Duplex Master</b>, Hardware NSS Signal=<b>Disable</b>

  2. Configure pins PE13 .. PE15 as SPI1 peripheral alternative pins
     - Click in chip diagram on pin \b PE13 and select \b SPI1_SCK
     - Click in chip diagram on pin \b PE14 and select \b SPI1_MISO
     - Click in chip diagram on pin \b PE15 and select \b SPI1_MOSI

Clock Configuration tab
-----------------------
  1. Configure APB1 Clock (maximum frequency is 48 MHz)
    - Setup "APB1 peripheral clocks (MHz)" to match application requirements

Configuration tab
-----------------
  1. Under Connectivity open \b SPI1 Configuration:
     - Parameter Settings: not used
     - User Constants: not used
     - <b>NVIC Settings</b>: enable interrupts
          Interrupt Table                           | Enabled | Preemption Priority
          :-----------------------------------------|:--------|:-------------------
          DMA1 channel 2 to 3 and DMA2 channel 1 .. |    ON   | 0
          SPI1 global interrupt                     | \b ON   | 0

     - \e optional <b>DMA Settings</b>: setup DMA transfers for Rx and Tx (DMA is optional)\n
       \b Add - Select \b SPI1_RX: Stream=DMA1 Channel 2, Direction=Peripheral to Memory, Priority=Low\n
          DMA Request Settings         | Label             | Peripheral | Memory
          :----------------------------|:------------------|:-----------|:-------------
          Mode: Normal                 | Increment Address | OFF        |\b ON
          .                            | Data Width        |\b Byte     | Byte
       \b Add - Select \b SPI1_TX: Stream=DMA1 Channel 3, Direction=Memory to Peripheral, Priority=Low\n
          DMA Request Settings         | Label             | Peripheral | Memory
          :----------------------------|:------------------|:-----------|:-------------
          Mode: Normal                 | Increment Address | OFF        |\b ON
          .                            | Data Width        |\b Byte     | Byte

     - <b>GPIO Settings</b>: review settings
          Pin Name | Signal on Pin | GPIO output..|  GPIO mode  | GPIO Pull-up/Pull..| Maximum out |  Fast Mode  | User Label
          :--------|:--------------|:-------------|:------------|:-------------------|:------------|:------------|:----------
          PE13     | SPI1_SCK      | n/a          | Alternate ..| No pull-up and no..| High        | n/a         |.
          PE14     | SPI1_MISO     | n/a          | Alternate ..| No pull-up and no..| High        | n/a         |.
          PE15     | SPI1_MOSI     | n/a          | Alternate ..| No pull-up and no..| High        | n/a         |.

     Click \b OK to close the SPI1 Configuration dialog
*/

/*! \cond */

#include "SPI_STM32F0xx.h"

#ifndef HAL_SPI_MODULE_ENABLED
  #warning "::Device:STM32Cube Framework: SPI Not configured."
#else

#define ARM_SPI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,0)

// Driver Version
static const ARM_DRIVER_VERSION DriverVersion = { ARM_SPI_API_VERSION, ARM_SPI_DRV_VERSION };

// Driver Capabilities
static const ARM_SPI_CAPABILITIES DriverCapabilities = {
  0,  /* Simplex Mode (Master and Slave) */
  1,  /* TI Synchronous Serial Interface */
  0,  /* Microwire Interface */
  1   /* Signal Mode Fault event: \ref ARM_SPI_EVENT_MODE_FAULT */
#if (defined(ARM_SPI_API_VERSION) && (ARM_SPI_API_VERSION >= 0x202U))
, 0U  /* Reserved bits */
#endif
};

// SPI1
#ifdef MX_SPI1
#ifdef  MX_SPI1_NSS_Pin
  SPIx_PIN_NSS_STRUCT_ALLOC(1);
#endif
// Allocate SPI Resources
SPIx_RESOURCE_ALLOC(1);
#endif

